app/views/users/show.html.erb

Full user history:
 <% @fullhistory = Useraction.where('user_id = ?', current_user.first_name).order('id DESC') %>
---
SELECT "useractions".* FROM "useractions" WHERE (user_id = 'Peter') ORDER BY id DESC