app/views/level3/lvl3.html.erb

        <table class="results_history">
        <% @history = Useraction.where('action_category = ? AND user_id = ?', 'solution', current_user.first_name).order('id DESC').limit(5) %>
---
SELECT "useractions".* FROM "useractions" WHERE (user_id = 'Peter') ORDER BY id DESC LIMIT $1  [["LIMIT", 5]]