app/controllers/application_controller.rb

  def current_user
    User.where(id: session[:user_id]).first
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]