app/controllers/useractions_controller.rb

  def create
    @useraction = Useraction.new(user_id: current_user.first_name, level: params[:level], action_category: params[:category], action_details: params[:details])
    respond_to do |format|
      @useraction.save
---
SELECT "useractions".* FROM "useractions" WHERE (user_id = 'Peter' AND level = 'level3') ORDER BY id DESC LIMIT $1  [["LIMIT", 5]]
INSERT INTO "useractions" ("user_id", "level", "action_category", "action_details", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def history
    @history = Useraction.where('user_id = ? AND level = ? AND action_category = ?', current_user.first_name, 'level3', 'solution').order('id DESC').limit(5)
---
SELECT "useractions".* FROM "useractions" WHERE (user_id = 'Peter' AND level = 'level3') ORDER BY id DESC LIMIT $1  [["LIMIT", 5]]