app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Peter"], ["last_name", ""], ["email", ""], ["password_digest", "[FILTERED]"], ["created_at", "2022-02-01 09:04:21.519065"], ["updated_at", "2022-02-01 09:04:21.519065"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "peter@peter.com"], ["password_digest", "[FILTERED]"], ["updated_at", "2022-02-01 09:38:51.934135"], ["id", 1]]